Repository: bioconductor-translations/bioc-intro-translation-Portuguese
Catalog: 20-r-rstudio_*.xliff
Languages: pt

source: ```{r, results="markup", fig.cap="Example of a working directory structure.", echo=FALSE, purl=FALSE, out.width="100%", fig.align="center"} knitr::include_graphics("fig/working-directory-structure.png") ``` For this course, we will need a `data/` folder to store our raw data, and we will use `data_output/` for when we learn how to export data as CSV files, and `fig_output/` folder for the figures that we will save.
pt: ```{r, results="markup", fig.cap="Exemplo de uma estrutura de diretório de trabalho.", echo=FALSE, purl=FALSE, out.width="100%", fig.align="center"} knitr::include_graphics("fig/working-directory-structure.png") ``` Para este curso, precisaremos de uma pasta `data/` para armazenar nossos dados brutos, e usaremos `data_output/` para quando aprendermos a exportar dados como arquivos CSV, e a pasta `fig_output/` para as figuras que salvaremos.

source: ::::::::::::::::::::::::::::::::::::::: challenge ## Challenge: create your project directory structure Under the `Files` tab on the right of the screen, click on `New Folder` and create a folder named `data` within your newly created working directory (e.g., `~/bioc-intro/data`).
pt: ::::::::::::::::::::::::::::::::::::: desafio ## Desafio: criar a estrutura de diretório de projeto Sob a aba `Arquivos` à direita da tela, clique em `Nova Pasta` e crie uma pasta chamada `data` dentro do seu diretório de trabalho (e.., `~/bioc-intro/data`).

source: (Alternatively, type `dir.create("data")` at your R console.)
pt: (Alternativamente, digite `dir.create("data")` em seu console R.)

source: Repeat these operations to create a `data_output/` and a `fig_output` folders.
pt: Repita estas operações para criar uma pasta `data_output/` e uma pasta `fig_output`.

source: :::::::::::::::::::::::::::::::::::::::::::::::::: We are going to keep the script in the root of our working directory because we are only going to use one file and it will make things easier.
pt: :::::::::::::::::::::::::::::::::::::::::: Vamos manter o script na raiz do nosso diretório de trabalho para usar apenas um arquivo e tornar as coisas mais fáceis.

source: Your working directory should now look like this: ```{r, results="markup", fig.cap="How it should look like at the beginning of this lesson", echo=FALSE, purl=FALSE, out.width="100%", fig.align="center"} knitr::include_graphics("fig/r-starting-how-it-should-look-like.png") ``` **Project management** is also applicable to bioinformatics projects, of course[^bioindatascience].
pt: O seu diretório de trabalho deve agora ter o seguinte aspecto: ```{r, results="markup", fig.cap="Como deve ser no início desta lição", echo=FALSE, purl=FALSE, out.width="100%", fig.align="center"} knitr::include_graphics("fig/r-starting-how-it-should-look-like.png") ``` **A gestão de projectos** é também aplicável para projetos de bioinformática, do curso[^bioindatascience].

source: William Noble (@Noble:2009) proposes the following directory structure: [^bioindatascience]: In this course, we consider bioinformatics as data science applied to biological or bio-medical data.
pt: William Noble (@Noble:2009) propõe a seguinte estrutura de directórios: [^bioindatascience]: Neste curso, consideramos a bioinformática como ciência de dados aplicada a dados biológicos ou biomédicos.

source: > Directory names are in large typeface, and filenames are in smaller > typeface.
pt: > Os nomes de diretório estão em maiúsculo, e os nomes de arquivos estão em minúsculo.

source: Only a subset of the files are shown here.
pt: Apenas um subconjunto dos arquivos é mostrado aqui.

source: Note that the > dates are formatted `<year>-<month>-<day>` so that they can be > sorted in chronological order.
pt: Note que as datas > estão formatadas `<year>-<month>-<day>` para que possam ser > ordenadas por ordem cronológica.

source: The source code `src/ms-analysis.c` > is compiled to create `bin/ms-analysis` and is documented in > `doc/ms-analysis.html`.
pt: O código fonte `src/ms-analysis.c` > é compilado para criar `bin/ms-analysis` e é documentado em > `doc/ms-analysis.html`.

source: The `README` files in the data directories > specify who downloaded the data files from what URL on what > date.
pt: Os arquivos `README` nos diretórios de dados > especificam quem baixou os arquivos de dados da URL e em que > data.

source: The driver script `results/2009-01-15/runall` automatically > generates the three subdirectories split1, split2, and split3, > corresponding to three cross-validation splits.
pt: O script `results/2009-01-15/runall` gera automaticamente > os três subdiretórios split1, split2, e split3, > correspondentes a três divisões de validação cruzada.

source: The > `bin/parse-sqt.py` script is called by both of the `runall` driver > scripts.
pt: O script > `bin/parse-sqt.py` é chamado por ambos os scripts `runall` >.

source: ```{r bioinfoproj, fig.cap="Directory structure for a sample bioinformatics project.", out.width="100%", echo=FALSE} knitr::include_graphics("fig/noble-bioinfo-project.png") ``` The most important aspect of a well defined and well documented project directory is to enable someone unfamiliar with the project[^futureself] to 1.
pt: ```{r bioinfoproj, fig.cap="Estrutura de diretório para um exemplo de projeto de bioinformática.", out.width="100%", echo=FALSE} knitr::include_graphics("fig/noble-bioinfo-project.png") ``` O aspeto mais importante de um diretório de projeto bem definido e bem documentado é permitir que alguém não familiarizado com o projeto: 1.

source: understand what the project is about, what data are available, what analyses were run, and what results were produced and, most importantly to 2.
pt: entender o que é o projeto, quais dados estão disponíveis, análises executadas, e quais resultados foram produzidos e, principalmente, importante para 2.

source: repeat the analysis over again - with new data, or changing some analysis parameters.
pt: repetir a análise mais uma vez - com novos dados ou alterando alguns parâmetros de análise.

source: [^futureself]: That someone could be, and very likely will be your future self, a couple of months or years after the analyses were run.
pt: [^futureself]: Esse alguém pode ser, e muito provavelmente será, o seu eu futuro, alguns meses ou anos depois de as análises terem sido efetuadas.

source: ### The working directory The working directory is an important concept to understand.
pt: ### O diretório de trabalho O diretório de trabalho é um conceito importante para se entender.

source: It is the place from where R will be looking for and saving the files.
pt: É o lugar de onde R estará procurando e salvando os arquivos.

source: When you write code for your project, it should refer to files in relation to the root of your working directory and only need files within this structure.
pt: Quando escrever código para o seu projeto, este deve referir-se a arquivosem relação à raiz do seu diretório de trabalho e só precisar de arquivos presentes nesta estrutura.

source: Using RStudio projects makes this easy and ensures that your working directory is set properly.
pt: A utilização de projetos RStudio facilita este processo e garante que o seu diretório de trabalho está definido corretamente.

source: If you need to check it, you can use `getwd()`.
pt: Se você precisar verificar, você pode usar `getwd()`.

source: If for some reason your working directory is not what it should be, you can change it in the RStudio interface by navigating in the file browser where your working directory should be, and clicking on the blue gear icon `More`, and select `Set As Working Directory`.
pt: Se, por alguma razão, o seu diretório de trabalho não é o que deveria ser, pode alterá-lo na interface do RStudio navegando nas pastas onde o seu diretório de trabalho deveria estar, e clicando no ícone da engrenagem azul `Mais`, e selecionanando `Definir como Diretório de Trabalho`.

source: Alternatively you can use `setwd("/path/to/working/directory")` to reset your working directory.
pt: Alternativamente, você pode utilizar `setwd("/caminho/para/diretório de trabalho")` para redefinir o seu diretório de trabalho.

source: However, your scripts should not include this line because it will fail on someone else's computer.
pt: No entanto, os seus scripts não devem incluir esta linha porque irá falhar no computador de outra pessoa.

source: **Example** The schema below represents the working directory `bioc-intro` with the `data` and `fig_output` sub-directories, and 2 files in the latter: ``` bioc-intro/data/ /fig_output/fig1.pdf /fig_output/fig2.png ``` If we were in the working directory, we could refer to the `fig1.pdf` file using the relative path `bioc-intro/fig_output/fig1.pdf` or the absolute path `/home/user/bioc-intro/fig_output/fig1.pdf`.
pt: **Exemplo** O esquema abaixo representa o diretório de trabalho `bioc-intro` com os sub-diretórios `data` e `fig_output`, e 2 arquivos neste último: ``` bioc-intro/data/ /fig_output/fig1.pdf /fig_output/fig2.png ``` Se estivéssemos no diretório de trabalho, poderíamos acessar o arquivo `fig1.pdf` usando o caminho relativo `bioc-intro/fig_output/fig1.pdf` ou o caminho absoluto `/home/user/bioc-intro/fig_output/fig1.pdf`.

source: If we were in the `data` directory, we would use the relative path `../fig_output/fig1.pdf` or the same absolute path `/home/user/bioc-intro/fig_output/fig1.pdf`.
pt: Se estivéssemos no diretório `data`, utilizaríamos o caminho relativo `../fig_output/fig1.pdf` ou o mesmo caminho absoluto `/home/user/bioc-intro/fig_output/fig1.pdf`.

source: ## Interacting with R The basis of programming is that we write down instructions for the computer to follow, and then we tell the computer to follow those instructions.
pt: ## Interagindo com o R A base da programação é que escrevemos instruções para o computador, e depois dizemos ao computador para seguir essas instruções.

source: We write, or *code*, instructions in R because it is a common language that both the computer and we can understand.
pt: Escrevemos, ou *codificamos*, instruções em R porque é uma linguagem comum que tanto o computador como nós podemos compreender.

source: We call the instructions *commands* and we tell the computer to follow the instructions by *executing* (also called *running*) those commands.
pt: Chamamos as instruções de *comandos* e dizemos ao computador para seguir as instruções, *executando* (também chamado de *running*) esses comandos.

source: There are two main ways of interacting with R: by using the **console** or by using **scripts** (plain text files that contain your code).
pt: Existem duas formas principais de interagir com o R: utilizando a **console** ou utilizando **scripts** (arquivos de texto simples que contêm o seu código).

source: The console pane (in RStudio, the bottom left panel) is the place where commands written in the R language can be typed and executed immediately by the computer.
pt: O painel de console (em RStudio, o painel inferior esquerdo) é o local onde comandos escritos no idioma R podem ser digitados e são executados imediatamente pelo computador.

source: It is also where the results will be shown for commands that have been executed.
pt: É também onde os resultados serão mostrados para os comandos que foram executados.

source: You can type commands directly into the console and press `Enter` to execute those commands, but they will be forgotten when you close the session.
pt: Você pode escrever comandos diretamente no console e pressionar `Enter` para executar esses comandos, mas estes serão esquecidos quando fechar a sessão.

source: Because we want our code and workflow to be reproducible, it is better to type the commands we want in the script editor, and save the script.
pt: Uma vez que pretendemos que o nosso código e fluxo de trabalho sejam reprodutíveis, é melhor escrever os comandos que pretendemos no editor de scripts e salvar o script.

source: This way, there is a complete record of what we did, and anyone (including our future selves!) can easily replicate the results on their computer.
pt: Desta forma, existe um registro completo do que fizemos e qualquer pessoa (incluindo os nossos futuros eus!) pode facilmente reproduzir os resultados no seu computador.

source: Note, however, that merely typing the commands in the script does not automatically *run* them - they still need to be sent to the console for execution.
pt: Note, no entanto, que apenas digitar os comandos no script não os *executa* automaticamente - eles ainda precisam ser enviados para o console para execução.

source: RStudio allows you to execute commands directly from the script editor by using the `Ctrl` + `Enter` shortcut (on Macs, `Cmd` + `Return` will work, too).
pt: O RStudio permite-lhe executar comandos diretamente a partir do editor de scripts utilizando o atalho `Ctrl` + `Enter` (em Macs, `Cmd` + `Return` também funciona).

source: The command on the current line in the script (indicated by the cursor) or all of the commands in the currently selected text will be sent to the console and executed when you press `Ctrl` + `Enter`.
pt: O comando na linha atual do script (indicado pelo cursor) ou todos os comandos no texto atualmente selecionado serão enviados para o console e executados quando você pressionar `Ctrl` + `Enter`.

source: You can find other keyboard shortcuts in this [RStudio cheatsheet about the RStudio IDE](https://raw.githubusercontent.com/rstudio/cheatsheets/main/rstudio-ide.pdf).
pt: Pode encontrar outros atalhos de teclado nesta [Folha de dicas do RStudio sobre o IDE RStudio](https://raw.githubusercontent.com/rstudio/cheatsheets/main/rstudio-ide.pdf).

source: You can type these commands and execute them directly in the console.
pt: Você pode digitar esses comandos e executar eles diretamente no console.

source: RStudio provides the `Ctrl` + `1` and `Ctrl` + `2` shortcuts allow you to jump between the script and the console panes.
pt: O RStudio fornece os atalhos `Ctrl` + `1` e `Ctrl` + `2` que lhe permitem saltar entre o script e os painéis do console.

source: If R is ready to accept commands, the R console shows a `>` prompt.
pt: Se R estiver pronto para aceitar comandos, o console R te mostra um prompt `>`.

source: If it receives a command (by typing, copy-pasting or sending from the script editor using `Ctrl` + `Enter`), R will try to execute it, and when ready, will show the results and come back with a new `>` prompt to wait for new commands.
pt: Se receber um comando (digitando, copiando e colando ou enviando do editor de scripts usando `Ctrl` + `Enter`), o R tentará executá-lo, e quando estiver pronto, mostrará os resultados e voltará com um novo prompt `>` para aguardar novos comandos.

source: If R is still waiting for you to enter more data because it isn't complete yet, the console will show a `+` prompt.
pt: Se R ainda estiver esperando que você insira mais dados porque ele ainda não está concluído, o console irá mostrar uma solicitação `+`.

source: It means that you haven't finished entering a complete command.
pt: Significa que você ainda não terminou de entrar com um comando completo.

source: This is because you have not 'closed' a parenthesis or quotation, i.e. you don't have the same number of left-parentheses as right-parentheses, or the same number of opening and closing quotation marks.
pt: Isto se deve ao fato de não ter "fechado" um parêntesis ou uma aspa, ou seja, não tem o mesmo número de parêntesis à esquerda e de parêntesis à direita, ou o mesmo número de aspas de abertura e de fechamento.

source: When this happens, and you thought you finished typing your command, click inside the console window and press `Esc`; this will cancel the incomplete command and return you to the `>` prompt.
pt: Quando isso acontecer, e você pensou que tinha terminado de digitar o comando, clique dentro da janela do console e pressione `Esc`; isso cancelará o comando incompleto e retornará ao prompt `>`.

source: ## How to learn more during and after the course?
pt: ## Como aprender mais durante e após o curso?

source: The material we cover during this course will give you an initial taste of how you can use R to analyse data for your own research.
pt: O material que abordamos durante este curso te dará uma primeira ideia de como pode utilizar o R para analisar dados para a sua própria pesquisa.

source: However, you will need to learn more to do advanced operations such as cleaning your dataset, using statistical methods, or creating beautiful graphics[^inthiscoure].
pt: No entanto, terá de aprender mais para efetuar operações avançadas, tais como limpar o seu conjunto de dados, utilizar métodos estatísticos, ou criar gráficos bonitos[^inthiscoure].

source: The best way to become proficient and efficient at R, as with any other tool, is to use it to address your actual research questions.
pt: A melhor forma de se tornar proficiente e eficiente no R, como em qualquer outra ferramenta, é utilizá-lo para responder às suas questões de investigação.

source: As a beginner, it can feel daunting to have to write a script from scratch, and given that many people make their code available online, modifying existing code to suit your purpose might make it easier for you to get started.
pt: Para um principiante, pode ser assustador ter de escrever um script raiz e, dado que muitas pessoas disponibilizam o seu código online, modificar o código existente para se adequar ao seu objetivo pode facilitar no início.

source: [^inthiscoure]: We will introduce most of these (except statistics) here, but will only manage to scratch the surface of the wealth of what is possible to do with R. ```{r kitten, results="markup", echo=FALSE, purl=FALSE, out.width="400px", fig.align="center"} knitr::include_graphics("fig/kitten-try-things.jpg") ``` ## Seeking help ### Use the built-in RStudio help interface to search for more information on R functions ```{r rstudiohelp, fig.cap="RStudio help interface.", results="markup", echo=FALSE, purl=FALSE, out.width="70%", fig.align="center"} knitr::include_graphics("fig/rstudiohelp.png") ``` One of the fastest ways to get help, is to use the RStudio help interface.
pt: [^inthiscoure]: Iremos introduzir a maioria destes (exceto estatística) aqui, mas apenas conseguiremos arranhar a superfície da riqueza do que é possível fazer com o R. ```{r kitten, results="markup", echo=FALSE, purl=FALSE, out.width="400px", fig.align="center"} knitr::include_graphics("fig/kitten-try-things.jpg") ``` ## Procurando ajuda ### Utilize a interface de ajuda integrada do RStudio para procurar mais informações sobre as funções do R ```{r rstudiohelp, fig.cap="Interface de ajuda do RStudio.", results="markup", echo=FALSE, purl=FALSE, out.width="70%", fig.align="center"} knitr::include_graphics("fig/rstudiohelp.png") ``` Uma das formas mais rápidas de obter ajuda é usar a interface de ajuda do RStudio.

source: This panel by default can be found at the lower right hand panel of RStudio.
pt: Este painel por padrão pode ser encontrado na parte inferior direita painel do RStudio.

source: As seen in the screenshot, by typing the word "Mean", RStudio tries to also give a number of suggestions that you might be interested in.
pt: Como visto na captura de tela, digitando a palavra "Mean", O RStudio tenta também dar várias sugestões que você pode estar interessado.

source: The description is then shown in the display window.
pt: A descrição é mostrada na janela exibição.

source: ### I know the name of the function I want to use, but I'm not sure how to use it If you need help with a specific function, let's say `barplot()`, you can type: ```{r, eval=FALSE, purl=TRUE} ?barplot ``` If you just need to remind yourself of the names of the arguments, you can use: ```{r, eval=FALSE, purl=TRUE} args(lm) ``` ### I want to use a function that does X, there must be a function for it but I don't know which one...
pt: ### Eu sei o nome da função que quero usar, mas não tenho certeza de como usá-la Se você precisar de ajuda com uma função específica, digamos `barplot()`, você pode digitar: ```{r, eval=FALSE, purl=TRUE} ?barplot ``` Se apenas precisa de se lembrar dos nomes dos argumentos, pode utilizar: ```{r, eval=FALSE, purl=TRUE} args(lm) ``` ### Eu quero usar uma função que faz X, deve haver uma função para isso mas eu não sei qual...

source: If you are looking for a function to do a particular task, you can use the `help.search()` function, which is called by the double question mark `??`.
pt: Se estiver à procura de uma função para fazer uma tarefa específica, pode utilizar a função `help.search()`, que é chamada pelo duplo ponto de interrogação `??`.

source: However, this only looks through the installed packages for help pages with a match to your search request ```{r, eval=FALSE, purl=TRUE} ??kruskal ``` If you can't find what you are looking for, you can use the [rdocumentation.org](https://www.rdocumentation.org) website that searches through the help files across all packages available.
pt: No entanto, isto apenas procura nos pacotes instalados por páginas de ajuda que correspondem ao seu pedido de pesquisa ```{r, eval=FALSE, purl=TRUE} ??kruskal ``` Se não conseguir encontrar o que procura, pode utilizar o website [rdocumentation.org](https://www.rdocumentation.org) que procura através dos arquivos de ajuda em todos os pacotes disponíveis.

source: Finally, a generic Google or internet search "R \<task>" will often either send you to the appropriate package documentation or a helpful forum where someone else has already asked your question.
pt: Finalmente, uma pesquisa genérica no Google ou na Internet "R \<task>" irá, muitas vezes, enviá-lo para a documentação do pacote apropriado ou para um fórum útil onde alguém já colocou a sua pergunta.

source: ### I am stuck...
pt: ### Estou preso...

source: I get an error message that I don't understand Start by googling the error message.
pt: Eu recebo uma mensagem de erro que eu não entendo Iniciar procurando a mensagem de erro.

source: However, this doesn't always work very well because often, package developers rely on the error catching provided by R. You end up with general error messages that might not be very helpful to diagnose a problem (e.g. "subscript out of bounds").
pt: No entanto, isto nem sempre funciona muito bem porque, muitas vezes, os programadores de pacotes confiam na captura de erros fornecida pelo R. Você acaba por receber mensagens de erro genéricas que podem não ser muito úteis para diagnosticar um problema (por exemplo, "subscrito fora dos limites").

source: If the message is very generic, you might also include the name of the function or package you're using in your query.
pt: Se a mensagem for muito genérica, pode também incluir o nome da função ou do pacote que está utilizando na sua consulta.

source: However, you should check Stack Overflow.
pt: No entanto, você deve verificar o Stack Overflow.

source: Search using the `[r]` tag.
pt: Pesquise usando a tag `[r]`.
