Repository: bioconductor-translations/bioc-intro-translation-Portuguese
Catalog: 20-r-rstudio_*.xliff
Languages: pt

source: Most questions have already been answered, but the challenge is to use the right words in the search to find the answers: [http://stackoverflow.com/questions/tagged/r](https://stackoverflow.com/questions/tagged/r) The [Introduction to R](https://cran.r-project.org/doc/manuals/R-intro.pdf) can also be dense for people with little programming experience but it is a good place to understand the underpinnings of the R language.
pt: A maioria das perguntas já foi respondida, mas o desafio é usar as palavras certas na pesquisa para encontrar as respostas: [http://stackoverflow.com/questions/tagged/r](https://stackoverflow.com/questions/tagged/r) A [Introduction to R](https://cran.r-project.org/doc/manuals/R-intro.pdf) pode também ser densa para pessoas com pouca experiência em programação, mas é uma boa referência para compreender os fundamentos da linguagem R.

source: The [R FAQ](https://cran.r-project.org/doc/FAQ/R-FAQ.html) is dense and technical but it is full of useful information.
pt: O [R FAQ](https://cran.r-project.org/doc/FAQ/R-FAQ.html) é denso e técnico mas está cheio de informações úteis.

source: ### Asking for help The key to receiving help from someone is for them to rapidly grasp your problem.
pt: ### Pedir ajuda A chave para receber ajuda de alguém é que essa pessoa compreenda rapidamente o seu problema.

source: You should make it as easy as possible to pinpoint where the issue might be.
pt: Você deve tornar o mais fácil possível identificar onde o problema pode estar.

source: Try to use the correct words to describe your problem.
pt: Tente usar as palavras corretas para descrever seu problema.

source: For instance, a package is not the same thing as a library.
pt: Por exemplo, um pacote não é a mesma coisa que uma biblioteca.

source: Most people will understand what you meant, but others have really strong feelings about the difference in meaning.
pt: A maioria das pessoas irá compreender o que quis dizer, mas outras têm sentimentos muito fortes sobre a diferença de significado.

source: The key point is that it can make things confusing for people trying to help you.
pt: A questão principal é que isso pode tornar as coisas confusas para as pessoas que tentam ajudá-lo.

source: Be as precise as possible when describing your problem.
pt: Seja tão preciso quanto o possível ao descrever o seu problema.

source: If possible, try to reduce what doesn't work to a simple *reproducible example*.
pt: Se possível, tente reduzir o que não funciona a um simples *exemplo reprodutível *.

source: If you can reproduce the problem using a very small data frame instead of your 50000 rows and 10000 columns one, provide the small one with the description of your problem.
pt: Se conseguir reproduzir o problema utilizando uma amostra de dados em vez do arquivo de 50000 linhas e 10000 colunas, forneça a amostra com a descrição do seu problema.

source: When appropriate, try to generalise what you are doing so even people who are not in your field can understand the question.
pt: Se for caso disso, tente generalizar o que está fazendo para que mesmo as pessoas que não estão na sua área possam compreender a pergunta.

source: For instance instead of using a subset of your real dataset, create a small (3 columns, 5 rows) generic one.
pt: Por exemplo, pode em vez de utilizar um subconjunto do seu conjunto de dados real, criar um pequeno (3 colunas, 5 linhas) arquivo genérico.

source: For more information on how to write a reproducible example see [this article by Hadley Wickham](https://adv-r.had.co.nz/Reproducibility.html).
pt: Para mais informações sobre como escrever um exemplo reprodutível em, consulte [este artigo de Hadley Wickham] (https://adv-r.had.co.nz/Reproducibility.html).

source: To share an object with someone else, if it's relatively small, you can use the function `dput()`.
pt: Para compartilhar um objeto com outra pessoa, se for relativamente pequeno, você pode usar a função `dput()`.

source: It will output R code that can be used to recreate the exact same object as the one in memory: ```{r, results="show", purl=TRUE} ## iris is an example data frame that comes with R and head() is a ## function that returns the first part of the data frame dput(head(iris)) ``` If the object is larger, provide either the raw file (i.e., your CSV file) with your script up to the point of the error (and after removing everything that is not relevant to your issue).
pt: É um código R que pode ser utilizado para recriar exatamente o mesmo objeto da memória: ```{r, results="show", purl=TRUE} ## iris a example data frame que vem com R e head() é a ## função que retorna a primeira parte do quadro de dados dput(head(iris)) ``` Se o objeto for maior, forneça o arquivo raw (i.., seu arquivo CSV) com o seu script até o ponto do erro (e depois de removendo tudo o que não é relevante para o seu problema).

source: Alternatively, in particular if your question is not related to a data frame, you can save any R object to a file[^export]: ```{r, eval=FALSE, purl=FALSE} saveRDS(iris, file="/tmp/iris.rds") ``` The content of this file is however not human readable and cannot be posted directly on Stack Overflow.
pt: Como alternativa, em particular, se sua pergunta não estiver relacionada a a uma tabela, você pode salvar qualquer objeto R em um arquivo[^export]: ```{r, eval=FALSE, purl=FALSE} saveRDS(iris, file="/tmp/iris. ``` O conteúdo deste arquivo não é legível e não pode ser publicado diretamente no Stack Overflow.

source: Instead, it can be sent to someone by email who can read it with the `readRDS()` command (here it is assumed that the downloaded file is in a `Downloads` folder in the user's home directory): ```{r, eval=FALSE, purl=FALSE} some_data <- readRDS(file="~/Downloads/iris.rds") ``` Last, but certainly not least, **always include the output of `sessionInfo()`** as it provides critical information about your platform, the versions of R and the packages that you are using, and other information that can be very helpful to understand your problem.
pt: Em vez disso, ele pode ser enviado para alguém por e-mail que pode lê-lo com o comando `readRDS()` (aqui está assumindo que o arquivo baixado está em uma pasta `Downloads` no diretório do usuário do): ```{r, eval=FALSE, purl=FALSE} some_data <- readRDS(file="~/Downloads/iris. ``` Por último, mas certamente não menos importante, **sempre inclua a saída do `sessionInfo()`** como ele fornece informações críticas sobre sua plataforma, as versões de R e os pacotes que você está usando, e outras informações que podem ser muito úteis para entender seu problema.

source: ```{r, results="show", purl=TRUE} sessionInfo() ``` ### Where to ask for help?
pt: ```{r, results="show", purl=TRUE} sessionInfo() ``` ### Onde pedir ajuda?

source: - The person sitting next to you during the course.
pt: - A pessoa sentada ao seu lado durante o curso.

source: Don't hesitate to talk to your neighbour during the workshop, compare your answers, and ask for help.
pt: Não hesite em falar com seu vizinho durante a oficina, comparar suas respostas, e pedir ajuda.

source: - Your friendly colleagues: if you know someone with more experience than you, they might be able and willing to help you.
pt: - Os seus colegas: se conhece alguém com mais experiência do que você, essa pessoa poderá estar disposta a ajudá-lo.

source: - [Stack Overflow](https://stackoverflow.com/questions/tagged/r): if your question hasn't been answered before and is well crafted, chances are you will get an answer in less than 5 min.
pt: - [Stack Overflow](https://stackoverflow.com/questions/tagged/r): se a sua pergunta não tiver sido respondida antes e for bem elaborada, é provável que obtenha uma resposta em menos de 5 minutos.

source: Remember to follow their guidelines on [how to ask a good question](https://stackoverflow.com/help/how-to-ask).
pt: Lembre-se de seguir as diretrizes sobre [como fazer uma boa pergunta](https://stackoverflow.com/help/how-to-ask).

source: - The [R-help mailing list](https://stat.ethz.ch/mailman/listinfo/r-help): it is read by a lot of people (including most of the R core team), a lot of people post to it, but the tone can be pretty dry, and it is not always very welcoming to new users.
pt: - A [lista de email R-help](https://stat.ethz. h/mailman/listinfo/r-help): é lida por muitas pessoas (incluindo a maior parte da equipe R), muitas pessoas postam nela, mas o tom pode ser bem seco, e nem sempre é muito bem-vindo a novos usuários.

source: If your question is valid, you are likely to get an answer very fast but don't expect that it will come with smiley faces.
pt: Se a sua pergunta for válida, é provável que obtenha uma resposta muito rapidamente, mas não espere que ela venha com carinhas sorridentes.

source: Also, here more than anywhere else, be sure to use correct vocabulary (otherwise you might get an answer pointing to the misuse of your words rather than answering your question).
pt: Além disso, aqui, mais do que em qualquer outro lugar, não se esqueça de utilizar o vocabulário correto (caso contrário, poderá receber uma resposta que aponta para a má utilização das suas palavras, em vez de responder à sua pergunta).

source: You will also have more success if your question is about a base function rather than a specific package.
pt: Também terá mais sucesso se a sua pergunta for sobre uma função do R base em vez de um pacote específico.

source: - If your question is about a specific package, see if there is a mailing list for it.
pt: - Se sua pergunta for sobre um pacote específico, veja se existe uma lista de e-mails para ele.

source: Usually it's included in the DESCRIPTION file of the package that can be accessed using `packageDescription("name-of-package")`.
pt: Normalmente está incluído no ficheiro DESCRIPTION do pacote que pode ser acessado utilizando `packageDescription("name-of-package")`.

source: You may also want to try to email the author of the package directly, or open an issue on the code repository (e.g., GitHub).
pt: Você também pode tentar enviar um e-mail diretamente ao autor do pacote ou abrir um problema no repositório de código (por exemplo, GitHub).

source: - There are also some topic-specific mailing lists (GIS, phylogenetics, etc...), the complete list is [here](https://www.r-project.org/mail.html).
pt: - Existem também algumas listas de email de discussão sobre temas específicos (GIS, phylogenetics, etc...), a lista completa é [here](https://www.r-project.org/mail.html).

source: ### More resources - The [Posting Guide](https://www.r-project.org/posting-guide.html) for the R mailing lists.
pt: ### Mais recursos - O [Posting Guide](https://www.r-project.org/posting-guide.html) para as listas de discussão em email do R.

source: - [How to ask for R help](https://blog.revolutionanalytics.com/2014/01/how-to-ask-for-r-help.html) useful guidelines.
pt: - [Como pedir ajuda no R] (https://blog.revolutionanalytics.com/2014/01/how-to-ask-for-r-help.html) orientações úteis.

source: - [This blog post by Jon Skeet](https://codeblog.jonskeet.uk/2010/08/29/writing-the-perfect-question/) has quite comprehensive advice on how to ask programming questions.
pt: - Este post do blog de Jon Skeet](https://codeblog.jonskeet.uk/2010/08/29/writing-the-perfect-question/) tem conselhos bastante abrangentes sobre como fazer perguntas sobre programação.

source: - The [reprex](https://cran.rstudio.com/web/packages/reprex/) package is very helpful to create reproducible examples when asking for help.
pt: - O pacote [reprex](https://cran.rstudio.com/web/packages/reprex/) é muito útil para criar exemplos reprodutíveis quando se pede ajuda.

source: The rOpenSci community call "How to ask questions so they get answered" ([Github link](https://github.com/ropensci/commcalls/issues/14) and [video recording](https://vimeo.com/208749032)) includes a presentation of the reprex package and of its philosophy.
pt: A comunidade rOpenSci "How to ask questions so they get answered" ([Github link](https://github. om/ropensci/commcalls/issues/14) e [gravação de vídeo](https://vimeo.com/208749032)) inclui uma apresentação de o pacote reprex e sua filosofia.

source: ## R packages ### Loading packages As we have seen above, R packages play a fundamental role in R. The make use of a package's functionality, assuming it is installed, we first need to load it to be able to use it.
pt: ## Pacotes do R ### Carregando pacotes Como vimos acima, os pacotes do R desempenham um papel fundamental. Para utilizar funcionalidade de um pacote, assumindo que ele está instalado, nós precisamos primeiro carregá-lo.

source: This is done with the `library()` function.
pt: Isto é feito com a função `library()`.

source: Below, we load `ggplot2`.
pt: Abaixo, carregamos o `ggplot2`.

source: ```{r loadp, eval=FALSE, purl=TRUE} library("ggplot2") ``` ### Installing packages The default package repository is The *Comprehensive R Archive Network* (CRAN), and any package that is available on CRAN can be installed with the `install.packages()` function.
pt: ```{r loadp, eval=FALSE, purl=TRUE} library("ggplot2") ``` ### Instalando pacotes O repositório de pacotes padrão é o *Comprehensive R Archive Network* (CRAN), e qualquer pacote que esteja disponível no CRAN pode ser instalado com a função `install.packages()`.

source: Below, for example, we install the `dplyr` package that we will learn about later.
pt: Abaixo, por exemplo, instalamos o pacote `dplyr` que aprenderemos mais tarde.

source: ```{r craninstall, eval=FALSE, purl=TRUE} install.packages("dplyr") ``` This command will install the `dplyr` package as well as all its dependencies, i.e. all the packages that it relies on to function.
pt: ```{r craninstall, eval=FALSE, purl=TRUE} install.packages("dplyr") ``` Este comando irá instalar o pacote `dplyr` bem como todas as suas dependências, ou seja, todos os pacotes dos quais ele depende para funcionar.

source: Another major R package repository is maintained by Bioconductor.
pt: Outro repositório de pacotes principais do R é mantido pelo Bioconductor.

source: [Bioconductor packages](https://bioconductor.org/packages/release/BiocViews.html#___Software) are managed and installed using a dedicated package, namely `BiocManager`, that can be installed from CRAN with ```{r, eval=FALSE, purl=TRUE} install.packages("BiocManager") ``` Individual packages such as `SummarizedExperiment` (we will use it later), `DESeq2` (for RNA-Seq analysis), and any others from either Bioconductor or CRAN can then be installed with `BiocManager::install`.
pt: Os [pacotes do Bioconductor](https://bioconductor.org/packages/release/BiocViews.html#___Software) são geridos e instalados utilizando um pacote dedicado, nomeadamente o `BiocManager`, que pode ser instalado a partir do CRAN com ```{r, eval=FALSE, purl=TRUE} install.packages("BiocManager") ``` Pacotes individuais como o `SummarizedExperiment` (nós o usaremos mais tarde), `DESeq2` (para análise de RNA-Seq), e quaisquer outros do Bioconductor ou do CRAN podem ser instalados com `BiocManager::install`.

source: ```{r, eval=FALSE, purl=TRUE} BiocManager::install("SummarizedExperiment") BiocManager::install("DESeq2") ``` By default, `BiocManager::install()` will also check all your installed packages and see if there are newer versions available.
pt: ```{r, eval=FALSE, purl=TRUE} BiocManager::install("SummarizedExperiment") BiocManager::install("DESeq2") ``` Por padrão, `BiocManager::install()` também verificará todos os pacotes instalados e verá se há versões mais recentes disponíveis.

source: If there are, it will show them to you and ask you if you want to `Update all/some/none?
pt: Se houver, mostrará a você e perguntará se você quer `Atualizar todos/alguém/nenhum?

source: [a/s/n]:` and then wait for your answer.
pt: [a/s/n]:` e depois espera pela sua resposta.

source: While you should strive to have the most up-to-date package versions, in practice we recommend only updating packages in a fresh R session before any packages are loaded.
pt: Você deve se esforçar para ter as versões mais atualizadas dos pacotes, no entanto, na prática, recomendamos atualizar pacotes apenas em uma sessão nova em R antes de quaisquer pacotes serem carregados.

source: :::::::::::::::::::::::::::::::::::::::: keypoints - Start using R and RStudio ::::::::::::::::::::::::::::::::::::::::::::::::::
pt: :::::::::::::::::::::::::::::::::::::::: keypoints - Começar a utilizar o R e o RStudio ::::::::::::::::::::::::::::::::::::::::::::::::::
