Repository: bioconductor-translations/bioc-intro-translation-Portuguese
Catalog: 20-r-rstudio_*.xliff
Languages: pt

source: --- source: Rmd title: R and RStudio teaching: 30 exercises: 0 --- ```{r, include=FALSE} ``` ::::::::::::::::::::::::::::::::::::::: objectives - Describe the purpose of the RStudio Script, Console, Environment, and Plots panes.
pt: --- source: Rmd title: R and RStudio teaching: 30 exercises: 0 --- ```{r, include=FALSE} ``` ::::::::::::::::::::::::::::::::::::::: Objetivos - Descrever o propósito dos paineis do RStudio: Script, Console, Enviroment and Plots.

source: - Organise files and directories for a set of analyses as an R project, and understand the purpose of the working directory.
pt: - Organizar arquivos e diretórios para um conjunto de análises como um projeto R, e entender o propósito do diretório de trabalho.

source: - Use the built-in RStudio help interface to search for more information on R functions.
pt: - Utilize a interface de ajuda integrada do RStudio para procurar mais informações sobre as funções do R.

source: - Demonstrate how to provide sufficient information for troubleshooting with the R user community.
pt: - Demonstre como fornecer informações suficientes para solucionar problemas utilizando a comunidade de usuários do R.

source: :::::::::::::::::::::::::::::::::::::::::::::::::: :::::::::::::::::::::::::::::::::::::::: questions - What are R and RStudio?
pt: :::::::::::::::::::::::::::::::::::::::::::::::::: :::::::::::::::::::::::::::::::::::::::: perguntas - O que são o R e o RStudio?

source: :::::::::::::::::::::::::::::::::::::::::::::::::: ## What is R?
pt: :::::::::::::::::::::::::::::::::::::::::::::::::: ## O que é o R?

source: What is RStudio?
pt: O que é RStudio?

source: The term [R](https://www.r-project.org/) is used to refer to the *programming language*, the *environment for statistical computing* and *the software* that interprets the scripts written using it.
pt: O termo [R](https://www.r-project.org/) é utilizado para designar a *linguagem de programação*, o *ambiente de computação estatística* e o *software* que interpreta os scripts com essa linguagem.

source: [RStudio](https://rstudio.com) is currently a very popular way to not only write your R scripts but also to interact with the R software[^plainr].
pt: [RStudio](https://rstudio.com) é atualmente uma forma muito popular não só de escrever os seus scripts R mas também de interagir com o software R [^plainr].

source: To function correctly, RStudio needs R and therefore both need to be installed on your computer.
pt: Para funcionar corretamente, o RStudio necessita do R e ambos têm de estar instalados no seu computador.

source: [^plainr]: As opposed to using R directly from the command line console.
pt: [^plainr]: Ao invés de usar R diretamente do console.

source: There exist other software that interface and integrate with R, but RStudio is particularly well suited for beginners while providing numerous very advanced features.
pt: Existem outros softwares que fazem a interface e integram com o R, mas o RStudio é particularmente adequado para principiantes, ao mesmo tempo que oferece funcionalidades muito avançadas.

source: The [RStudio IDE Cheat Sheet](https://raw.githubusercontent.com/rstudio/cheatsheets/main/rstudio-ide.pdf) provides much more information than will be covered here, but can be useful to learn keyboard shortcuts and discover new features.
pt: O [RStudio IDE Cheat Sheet](https://raw.githubusercontent.com/rstudio/cheatsheets/main/rstudio-ide.pdf) fornece muito mais informações do que serão abordadas aqui, mas pode ser útil para aprender atalhos de teclado e descobrir novos recursos.

source: ## Why learn R?
pt: ## Por que aprender R?

source: ### R does not involve lots of pointing and clicking, and that's a good thing The learning curve might be steeper than with other software, but with R, the results of your analysis do not rely on remembering a succession of pointing and clicking, but instead on a series of written commands, and that's a good thing!
pt: ### R não envolve muitos cliques, e isso é bom A curva de aprendizagem pode ser mais acentuada do que com outros softwares, mas com R, os resultados da sua análise não dependem de se lembrar de uma sucessão de cliques, mas sim de uma série de comandos escritos e salvos, o que é bom!

source: So, if you want to redo your analysis because you collected more data, you don't have to remember which button you clicked in which order to obtain your results; you just have to run your script again.
pt: Assim, se quiser refazer a sua análise porque obteve mais dados, não tem de se lembrar em que botão clicou em qual ordem para obter os resultados; basta executar novamente o script.

source: Working with scripts makes the steps you used in your analysis clear, and the code you write can be inspected by someone else who can give you feedback and spot mistakes.
pt: Trabalhar com scripts torna os passos utilizados na sua análise claros, e o código que escreve pode ser inspecionado por outra pessoa que pode te dar feedback e detectar erros.

source: Working with scripts forces you to have a deeper understanding of what you are doing, and facilitates your learning and comprehension of the methods you use.
pt: Trabalhar com scrpts te obriga a ter uma compreensão mais profunda do que está fazendo e facilita a sua aprendizagem e compreensão dos métodos utilizados.

source: ### R code is great for reproducibility Reproducibility means that someone else (including your future self) can obtain the same results from the same dataset when using the same analysis code.
pt: ### O código em R é ótimo para a reprodutibilidade Reprodutibilidade significa que outra pessoa (incluindo o seu futuro eu) pode obter os mesmos resultados do mesmo conjunto de dados ao utilizar o mesmo código de análise.

source: R integrates with other tools to generate manuscripts or reports from your code.
pt: O R se integra com outras ferramentas para gerar manuscritos ou relatórios a partir do seu código.

source: If you collect more data, or fix a mistake in your dataset, the figures and the statistical tests in your manuscript or report are updated automatically.
pt: Se recolher mais dados ou corrigir um erro no seu conjunto de dados, as figuras e os testes estatísticos no seu manuscrito ou relatório serão atualizados automaticamente.

source: An increasing number of journals and funding agencies expect analyses to be reproducible, so knowing R will give you an edge with these requirements.
pt: Um número crescente de revistas e agências de financiamento espera que as análises sejam reprodutíveis, então o conhecimento de R te dará uma vantagem em relação a estes requisitos.

source: ### R is interdisciplinary and extensible With 10000+ packages[^whatarepkgs] that can be installed to extend its capabilities, R provides a framework that allows you to combine statistical approaches from many scientific disciplines to best suit the analytical framework you need to analyse your data.
pt: ### O R é interdisciplinar e extensível Com mais de 10000 pacotes [^whatarepkgs] que podem ser instalados para expandir as suas capacidades, o R fornece uma estrutura que te permite combinar abordagens estatísticas de muitas disciplinas científicas para melhor se adequar à estrutura analítica que necessita para analisar os seus dados.

source: For instance, R has packages for image analysis, GIS, time series, population genetics, and a lot more.
pt: Por exemplo, o R tem pacotes para análise de imagens, GIS, séries temporais, genética de populações e muito mais.

source: [^whatarepkgs]: i.e. add-ons that confer R with new functionality, such as bioinformatics data analysis.
pt: [^whatarepkgs]: ou seja, complementos que conferem ao R novas funcionalidades, como a análise de dados de bioinformática.

source: ```{r, fig.cap="Exponential increase of the number of packages available on [CRAN](https://cran.r-project.org/), the Comprehensive R Archive Network.
pt: ```{r, fig.cap="Aumento exponencial do número de pacotes disponíveis em [CRAN](https://cran.r-project.org/), em inglês, a Comprehensive R Archive Network.

source: From the R Journal, Volume 10/2, December 2018.", echo=FALSE, message=FALSE} knitr::include_graphics("fig/cran.png") ``` ### R works on data of all shapes and sizes The skills you learn with R scale easily with the size of your dataset.
pt: From the R Journal, Volume 10/2, December 2018.", echo=FALSE, message=FALSE} knitr::include_graphics("fig/cran.png") ``` ### R funciona com dados de todas as formas e tamanhos As skills que você aprende com R escalam facilmente com o tamanho do seu conjunto de dados.

source: Whether your dataset has hundreds or millions of lines, it won't make much difference to you.
pt: Mesmo que o seu conjunto de dados tenha centenas ou milhões de linhas, não fará muita diferença para o R.

source: R is designed for data analysis.
pt: O R foi concebido para a análise de dados.

source: It comes with special data structures and data types that make handling of missing data and statistical factors convenient.
pt: Ele inclui estruturas de dados especiais e tipos de dados que o tornam conveniente para o tratamento de dados em falta e de fatores estatísticos.

source: R can connect to spreadsheets, databases, and many other data formats, on your computer or on the web.
pt: O R pode ligar-se a planilhas, bases de dados e muitos outros formatos de dados, no seu computador ou na Web.

source: ### R produces high-quality graphics The plotting functionalities in R are extensive, and allow you to adjust any aspect of your graph to convey most effectively the message from your data.
pt: ### R produz gráficos de alta qualidade As funcionalidades de plotagem em R são extensas e o permitem ajustar qualquer aspecto do seu gráfico para transmitir de forma mais eficaz a mensagem dos seus dados.

source: ### R has a large and welcoming community Thousands of people use R daily.
pt: ### O R tem uma comunidade grande e acolhedora Milhares de pessoas usam o R diariamente.

source: Many of them are willing to help you through mailing lists and websites such as [Stack Overflow](https://stackoverflow.com/), or on the [RStudio community](https://community.rstudio.com/).
pt: Muitos deles estão dispostos a ajudá-lo através de listas de email e sites como [Stack Overflow](https://stackoverflow.com/), ou na [comunidade RStudio](https://community.rstudio.com/).

source: These broad user communities extend to specialised areas such as bioinformatics.
pt: Essas amplas comunidades de usuários se estendem a áreas especializadas como a bioinformática.

source: One such subset of the R community is [Bioconductor](https://bioconductor.org/), a scientific project for analysis and comprehension "of data from current and emerging biological assays."
pt: Um desses subconjuntos da comunidade R é o [Bioconductor](https://bioconductor.org/), um projeto científico para análise e compreensão "de dados biológicos atuais e emergentes

source: This workshop was developed by members of the Bioconductor community; for more information on Bioconductor, please see the companion workshop ["The Bioconductor Project"](https://carpentries-incubator.github.io/bioc-project/).
pt: Esta oficina foi desenvolvida por membros da comunidade Biocondutor; para mais informações sobre Bioconductor, por favor veja a oficina complementar ["O Projeto Biocondutor"](https://carpentries-incubator.github.io/bioc-project/).

source: ### Not only is R free, but it is also open-source and cross-platform Anyone can inspect the source code to see how R works.
pt: ### Não apenas R gratuito, mas também é de código aberto e multi-plataforma Qualquer um pode inspecionar o código-fonte para ver como o R funciona.

source: Because of this transparency, there is less chance for mistakes, and if you (or someone else) find some, you can report and fix bugs.
pt: Por causa desta transparência, há menos chances de erros e se você (ou alguém fora) encontrar alguns, você pode relatar e corrigi-los.

source: ## Knowing your way around RStudio Let's start by learning about [RStudio](https://www.rstudio.com/), which is an Integrated Development Environment (IDE) for working with R. The RStudio IDE open-source product is free under the [Affero General Public License (AGPL) v3](https://www.gnu.org/licenses/agpl-3.0.en.html).
pt: ## Conhecendo o RStudio Vamos começar aprendendo sobre o [RStudio](https://www.rstudio.com/), que é um Ambiente de Desenvolvimento Integrado (IDE) para trabalhar com R. O produto de código aberto RStudio IDE é gratuito sob a [Affero General Public License (AGPL) v3](https://www.gnu.org/licenses/agpl-3.0.en.html).

source: The RStudio IDE is also available with a commercial license and priority email support from Posit, Inc. We will use the RStudio IDE to write code, navigate the files on our computer, inspect the variables we are going to create, and visualise the plots we will generate.
pt: O IDE RStudio também está disponível com uma licença comercial e suporte prioritário por correio eletrónico da Posit, Inc. Utilizaremos o IDE RStudio para escrever código, navegar nas pastas do nosso computador, inspecionar as variáveis que vamos criar e visualizar os gráficos que vamos gerar.

source: RStudio can also be used for other things (e.g., version control, developing packages, writing Shiny apps) that we will not cover during the workshop.
pt: O RStudio também pode ser utilizado para outras coisas (por exemplo, controlo de versões, desenvolvimento de pacotes, escrita de aplicações Shiny) que não serão abordadas durante o workshop.

source: Clockwise from top left: Source, Environment/History, Files/Plots/Packages/Help/Viewer, Console.", echo=FALSE, purl=FALSE, out.width="100%", fig.align="center"} knitr::include_graphics("fig/rstudio-screenshot.png") ``` The RStudio window is divided into 4 "Panes": - the **Source** for your scripts and documents (top-left, in the default layout) - your **Environment/History** (top-right), - your **Files/Plots/Packages/Help/Viewer** (bottom-right), and - the R **Console** (bottom-left).
pt: A partir do canto superior esquerdo: Source, Environment/History, Files/Plots/Packages/Help/Viewer, Console.", echo=FALSE, purl=FALSE, out.width="100%", fig.align="center"} knitr::include_graphics("fig/rstudio-screenshot.png") ``` A janela do RStudio é dividida em 4 "Panes": - o **Source** é para os seus scripts e documentos (canto superior esquerdo, na disposição predefinida) - o seu **Environment/History** (canto superior direito), - os seus **Files/Plots/Packages/Help/Viewer** (canto inferior direito), e - o **Console** do R (canto inferior esquerdo).

source: The placement of these panes and their content can be customised (see menu, `Tools -> Global Options -> Pane Layout`).
pt: A colocação destes painéis e seu conteúdo podem ser personalizados (ver menu, `Tools -> Global Options-> Layout`).

source: One of the advantages of using RStudio is that all the information you need to write code is available in a single window.
pt: Uma das vantagens de utilizar o RStudio é que toda a informação que precisa para escrever código estára disponível numa única janela.

source: Additionally, with many shortcuts, **autocompletion**, and **highlighting** for the major file types you use while developing in R, RStudio will make typing easier and less error-prone.
pt: Além disso, com muitos atalhos, como **autocompletion**, e **highlight** para os principais tipos de arquivo que você usa durante o desenvolvimento em R, O RStudio tornará a digitação mais fácil e menos propensa a erros.

source: ## Getting set up It is good practice to keep a set of related data, analyses, and text self-contained in a single folder, called the **working directory**.
pt: ## Se rpeparando É uma boa prática manter um conjunto de dados, análises e textos relacionados contidos numa única pasta, chamada **working directory**.

source: All of the scripts within this folder can then use **relative paths** to files that indicate where inside the project a file is located (as opposed to absolute paths, which point to where a file is on a specific computer).
pt: Todos os scripts dentro desta pasta podem então utilizar **relative paths** para ficheiros que indicam onde, dentro do projeto, um ficheiro está localizado (em oposição aos caminhos absolutos, que apontam para onde um ficheiro está num computador específico).

source: Working this way makes it a lot easier to move your project around on your computer and share it with others without worrying about whether or not the underlying scripts will still work.
pt: Trabalhar desta forma torna muito mais fácil mover o seu projeto no seu computador e compartilhá-lo com outros sem se preocupar se os scripts subjacentes ainda funcionarão ou não.

source: RStudio provides a helpful set of tools to do this through its "Projects" interface, which not only creates a working directory for you, but also remembers its location (allowing you to quickly navigate to it) and optionally preserves custom settings and open files to make it easier to resume work after a break.
pt: O RStudio fornece um conjunto útil de ferramentas para fazer isso através da sua interface "Projetos", que não só cria um diretório de trabalho para si, mas também se lembra da sua localização (permitindo navegar rapidamente para ele) e, opcionalmente, preserva definições personalizadas e ficheiros abertos para facilitar a retomada do trabalho após uma pausa.

source: Go through the steps for creating an "R Project" for this tutorial below.
pt: Siga os passos abaixo para criar um "R Project" para este tutorial.

source: Start RStudio.
pt: Inicie o RStudio.

source: Under the `File` menu, click on `New project`.
pt: No menu `Arquivo` (File), clique em `Novo projeto`(New Project).

source: Choose `New directory`, then `New project`.
pt: Escolha `Novo diretório` (new directory), depois `Novo projeto` (new project).

source: Enter a name for this new folder (or "directory"), and choose a convenient location for it.
pt: Coloque um nome para esta nova pasta (ou "diretório") e escolha uma localização conveniente para a mesma.

source: This will be your **working directory** for this session (or whole course) (e.g., `bioc-intro`).
pt: Este será o seu **diretório de trabalho** para esta sessão (ou todo o curso) (por exemplo, `bioc-intro`).

source: Click on `Create project`.
pt: Clique em `create project`.

source: (Optional) Set Preferences to 'Never' save workspace in RStudio.
pt: (Opcional) Defina Preferências para "Nunca" guardar o workspace no RStudio.

source: RStudio's default preferences generally work well, but saving a workspace to .RData can be cumbersome, especially if you are working with larger datasets.
pt: As preferências predefinidas do RStudio geralmente funcionam bem, mas guardar um espaço de trabalho em .RData pode ser complicado, especialmente se estiver trabalhando com conjuntos de dados maiores.

source: To turn that off, go to Tools --> 'Global Options' and select the 'Never' option for 'Save workspace to .RData' on exit.
pt: Para desativar essa opção, vá a Ferramentas --> 'Opções globais' e selecione a opção 'Nunca' para 'Guardar espaço de trabalho em .RData' ao sair.

source: ```{r, results="markup", fig.cap="Set 'Save workspace to .RData on exit' to 'Never'", echo=FALSE, purl=FALSE, out.width="70%", fig.align="center"} knitr::include_graphics("fig/rstudio-preferences.png") ``` To avoid [character encoding issues between Windows and other operating systems](https://yihui.name/en/2018/11/biggest-regret-knitr/), we are going to set UTF-8 by default: ```{r, results="markup", fig.cap="Set the default text encoding to UTF-8 to save us headache in the coming future.
pt: ```{r, results="markup", fig.cap="Set 'Save workspace to .RData on exit' to 'Never'", echo=FALSE, purl=FALSE, out.width="70%", fig.align="center"} knitr::include_graphics("fig/rstudio-preferences.png") ``` Para evitar [problemas de codificação de caracteres entre o Windows e outros sistemas operativos ](https://yihui.name/en/2018/11/biggest-regret-knitr/), vamos definir UTF-8 por defeito: ```{r, results="markup", fig.cap="Defina a codificação de texto por defeito para UTF-8 para nos poupar dores de cabeça no futuro.

source: (Figure from the link above).", echo=FALSE, purl=FALSE, out.width="70%", fig.align="center"} knitr::include_graphics("fig/utf8.png") ``` ### Organizing your working directory Using a consistent folder structure across your projects will help keep things organised, and will also make it easy to find/file things in the future.
pt: (Figura do link acima).", echo=FALSE, purl=FALSE, out.width="70%", fig.align="center"} knitr::include_graphics("fig/utf8.png") ``` ### Organizando seu diretório de trabalho Usar uma estrutura de pastas consistente em seus projetos ajudará a manter as coisas organizadas, e também facilitará encontrar/arquivar coisas no futuro.

source: This can be especially helpful when you have multiple projects.
pt: Isto pode ser especialmente útil quando se tem vários projetos.

source: In general, you may create directories (folders) for **scripts**, **data**, and **documents**.
pt: Em geral, criamos diretorios (pastas) para **scripts**, **dados** e **documentos**.

source: - **`data/`** Use this folder to store your raw data and intermediate datasets you may create for the need of a particular analysis.
pt: - **`data/`** Utilize esta pasta para armazenar os seus dados em bruto e conjuntos de dados intermédios que crie para uma análise específica.

source: For the sake of transparency and [provenance](https://en.wikipedia.org/wiki/Provenance), you should *always* keep a copy of your raw data accessible and do as much of your data cleanup and preprocessing programmatically (i.e., with scripts, rather than manually) as possible.
pt: Por uma questão de transparência e [provenance](https://en.wikipedia.org/wiki/Provenance), deve *sempre* manter uma cópia dos seus dados brutos acessível e fazer o máximo possível de limpeza e pré-processamento de dados programaticamente (ou seja, com scripts, em vez de manualmente).

source: Separating raw data from processed data is also a good idea.
pt: Separar os dados em bruto dos dados processados é também uma boa ideia.

source: For example, you could have files `data/raw/tree_survey.plot1.txt` and `...plot2.txt` kept separate from a `data/processed/tree.survey.csv` file generated by the `scripts/01.preprocess.tree_survey.R` script.
pt: Por exemplo, você poderia ter os arquivos `data/raw/tree_survey.plot1.txt` e `...plot2.txt` mantidos separados de um arquivo `data/processed/tree.survey.csv` gerado por o script `scripts/01.preprocess.tree_survey.R`.

source: - **`documents/`** This would be a place to keep outlines, drafts, and other text.
pt: - **`documents/`** Este é o local para guardar esboços, rascunhos, e outros textos.

source: - **`scripts/`** (or `src`) This would be the location to keep your R scripts for different analyses or plotting, and potentially a separate folder for your functions (more on that later).
pt: - **`scripts/`** (ou `src`) Esta seria a localização para manter os seus scripts do R para diferentes análises ou gráficos, e potencialmente uma pasta separada para as suas funções (mais sobre isso mais tarde).

source: You may want additional directories or subdirectories depending on your project needs, but these should form the backbone of your working directory.
pt: Você pode querer diretórios ou subdiretórios adicionais dependendo de suas necessidades de projeto, mas eles devem formar a espinha dorsal do seu diretório funcional.
