Repository: bioconductor-translations/bioc-intro-translation-Portuguese
Catalog: 60-next-steps_*.xliff
Languages: pt

source: --- source: Rmd title: Next steps teaching: 45 exercises: 45 --- ```{r, include=FALSE} ``` ::::::::::::::::::::::::::::::::::::::: objectives - Introduce the Bioconductor project.
pt: --- source: Rmd title: Próximas etapas teaching: 45 exercises: 45 --- ```{r, include=FALSE} ``` ::::::::::::::::::::::::::::::::::::: objetivos - Introduzir o projeto do Biocondutor.

source: - Introduce the notion of data containers.
pt: - Introduzir o conceito de contêineres de dados.

source: - Give an overview of the `SummarizedExperiment`, extensively used in omics analyses.
pt: - Apresentar uma visão geral do `SummarizedExperiment`, o qual é amplamente utilizado em análises ômicas.

source: :::::::::::::::::::::::::::::::::::::::::::::::::: :::::::::::::::::::::::::::::::::::::::: questions - What is a `SummarizedExperiment`?
pt: :::::::::::::::::::::::::::::::::::::::::::::::::: :::::::::::::::::::::::::::::::::::::::: perguntas - O que é um `SummarizedExperiment`?

source: - What is Bioconductor?
pt: - O que é o Bioconductor?

source: :::::::::::::::::::::::::::::::::::::::::::::::::: ## Next steps ```{r, echo=FALSE, message=FALSE} library("tidyverse") ``` Data in bioinformatics is often complex.
pt: :::::::::::::::::::::::::::::::::::::::::::::::::: ## Próximos passos ```{r, echo=FALSE, message=FALSE} library("tidyverse") ``` Os dados em bioinformática são muitas vezes complexos.

source: To deal with this, developers define specialised data containers (termed classes) that match the properties of the data they need to handle.
pt: Para lidar com este problema, os programadores de definem contentores de dados especializados (denominados de classes) que correspondem às propriedades dos dados que necessitam ser manipulados.

source: This aspect is central to the **Bioconductor**[^Bioconductor] project which uses the same **core data infrastructure** across packages.
pt: Este aspeto é fundamental para o projeto do **Bioconductor**[^Bioconductor] que utiliza a mesma **infraestrutura de dados central** em todos os pacotes.

source: This certainly contributed to Bioconductor's success.
pt: Esta estrutura contribuiu certamente para o sucesso do Bioconductor.

source: Bioconductor package developers are advised to make use of existing infrastructure to provide coherence, interoperability, and stability to the project as a whole.
pt: Os programadores de pacotes do Bioconductor são aconselhados a utilizar a infraestrutura existente para proporcionar coerência, interoperabilidade e estabilidade ao projeto como um todo.

source: [^Bioconductor]: The [Bioconductor](https://www.bioconductor.org) was initiated by Robert Gentleman, one of the two creators of the R language.
pt: [^Bioconductor]: O [Bioconductor](https://www.bioconductor.org) foi iniciado por Robert Gentleman, um dos dois criadores da linguagem R.

source: Bioconductor provides tools dedicated to omics data analysis.
pt: O Bioconductor fornece ferramentas dedicadas a análise de dados ômicos.

source: Bioconductor uses the R statistical programming language and is open source and open development.
pt: O Bioconductor utiliza a linguagem de programação estatística R e tem o código e o desenvolvimento aberto.

source: To illustrate such an omics data container, we'll present the `SummarizedExperiment` class.
pt: Para ilustrar um contêiner de dados ômicos, apresentaremos a classe `SummarizedExperiment`.

source: ## SummarizedExperiment The figure below represents the anatomy of the SummarizedExperiment class.
pt: ## SummarizedExperiment A figura abaixo representa a anatomia da classe SummarizedExperiment.

source: ```{r SE, echo=FALSE, out.width="80%"} knitr::include_graphics("https://uclouvain-cbio.github.io/WSBIM1322/figs/SE.svg") ``` Objects of the class SummarizedExperiment contain : - **One (or more) assay(s)** containing the quantitative omics data (expression data), stored as a matrix-like object.
pt: ```{r SE, echo=FALSE, out.width="80%"} knitr::include_graphics("https://uclouvain-cbio.github.io/WSBIM1322/figs/SE.svg") ``` Os objectos da classe SummarizedExperiment contêm : - **Um (ou mais) ensaio(s) ** contendo os dados ômicos quantitativos (por exemplo os dados de expressão gênica), armazenados como um objeto do tipo matriz.

source: Features (genes, transcripts, proteins, ...) are defined along the rows, and samples along the columns.
pt: Variáveis (como genes, transcritos gênicos, proteínas etc.) são definidas ao longo das linhas e amostras ao longo das colunas.

source: - A **sample metadata** slot containing sample co-variates, stored as a data frame.
pt: - Um compartimento para **sample metadata** contém as co-variáveis da amostra, armazenada como `data. frame`.

source: Rows from this table represent samples (rows match exactly the columns of the expression data).
pt: As linhas desta tabela representam amostras (as linhas correspondem exatamente às colunas dos dados de expressão gênica).

source: - A **feature metadata** slot containing feature co-variates, stored as a data frame.
pt: - Um compartimento para **sample metadata** contém as co-variáveis da amostra, armazenada como `data.frame`.

source: The rows of this data frame match exactly the rows of the expression data.
pt: As linhas desta estrutura de dados correspondem exatamente às linhas dos dados da expressão.

source: The coordinated nature of the `SummarizedExperiment` guarantees that during data manipulation, the dimensions of the different slots will always match (i.e the columns in the expression data and then rows in the sample metadata, as well as the rows in the expression data and feature metadata) during data manipulation.
pt: A natureza coordenada do `SummarizedExperiment` garante que durante a manipulação dos dados, as dimensões dos diferentes compartimentos serão sempre correspondentes (por exemplo as colunas nos dados de expressão e, em seguida, as linhas nos metadados da amostra, bem como as linhas nos dados de expressão e metadados das variáveis) durante a manipulação dos dados.

source: For example, if we had to exclude one sample from the assay, it would be automatically removed from the sample metadata in the same operation.
pt: Por exemplo, se tivéssemos que excluir uma amostra do ensaio, esta seria automaticamente removida dos metadados da amostra na mesma operação.

source: The metadata slots can grow additional co-variates (columns) without affecting the other structures.
pt: Os compartimentos de metadados podem aumentar as co-variáveis adicionais (colunas) sem afetar as outras estruturas.

source: ### Creating a SummarizedExperiment In order to create a `SummarizedExperiment`, we will create the individual components, i.e the count matrix, the sample and gene metadata from csv files.
pt: ### Criando um SummarizedExperiment Para criar um `SummarizedExperiment`, vamos criar os componentes individuais, por exemplo a matriz de contagem, a amostra e os metadados dos genes de arquivos csv.

source: These are typically how RNA-Seq data are provided (after raw data have been processed).
pt: Normalmente, é assim que os dados de RNA-Seq são fornecidos (depois dos dados brutos terem sido processados).

source: ```{r, echo=FALSE, message=FALSE} rna <- read_csv("data/rnaseq.csv") ## count matrix counts <- rna %>% select(gene, sample, expression) %>% pivot_wider(names_from = sample, values_from = expression) ## convert to matrix and set row names count_matrix <- counts %>% select(-gene) %>% as.matrix() rownames(count_matrix) <- counts$gene ## sample annotation sample_metadata <- rna %>% select(sample, organism, age, sex, infection, strain, time, tissue, mouse) ## remove redundancy sample_metadata <- unique(sample_metadata) ## gene annotation gene_metadata <- rna %>% select(gene, ENTREZID, product, ensembl_gene_id, external_synonym, chromosome_name, gene_biotype, phenotype_description, hsapiens_homolog_associated_gene_name) # remove redundancy gene_metadata <- unique(gene_metadata) ## write to csv write.csv(count_matrix, file = "data/count_matrix.csv") write.csv(gene_metadata, file = "data/gene_metadata.csv", row.names = FALSE) write.csv(sample_metadata, file = "data/sample_metadata.csv", row.names = FALSE) ``` - **An expression matrix**: we load the count matrix, specifying that the first columns contains row/gene names, and convert the `data.frame` to a `matrix`.
pt: ```{r, echo=FALSE, message=FALSE} rna <- read_csv("data/rnaseq.csv") ## matriz de contagem counts <- rna %>% select(gene, sample, expression) %>% pivot_wider(names_from = sample, values_from = expression) ## converter para matriz e definir nomes de linhas count_matrix <- counts %>% select(-gene) %>% as.matrix() rownames(count_matrix) <- counts$gene ## anotação de amostras sample_metadata <- rna %>% select(sample, organism, age, sex, infection, strain, time, tissue, mouse) ## remover redundância sample_metadata <- unique(sample_metadata) ## anotação de genes gene_metadata <- rna %>% select(gene, ENTREZID, product, ensembl_gene_id, external_synonym, chromosome_name, gene_biotype, phenotype_description, hsapiens_homolog_associated_gene_name) # remover redundância gene_metadata <- unique(gene_metadata) ## salvar aquivo para csv write.csv(count_matrix, file = "data/count_matrix.csv") write.csv(gene_metadata, file = "data/gene_metadata.csv", row.names = FALSE) write.csv(sample_metadata, file = "data/sample_metadata.csv", row.names = FALSE) ``` - **Uma matriz de expressão**: carregamos a matriz de contagem, especificando que as primeiras colunas contêm nomes das linhas/genes, e convertemos o `data.frame` para uma `matriz`.

source: You can download it [here](https://carpentries-incubator.github.io/bioc-intro/data/count_matrix.csv).
pt: Você pode baixá-lo [aqui](https://carpentries-incubator.github.io/bioc-intro/data/count_matrix.csv).

source: ```{r} count_matrix <- read.csv("data/count_matrix.csv", row.names = 1) %>% as.matrix() count_matrix[1:5, ] dim(count_matrix) ``` - **A table describing the samples**, available [here](https://carpentries-incubator.github.io/bioc-intro/data/sample_metadata.csv).
pt: ```{r} count_matrix <- read.csv("data/count_matrix.csv", row.names = 1) %>% as.matrix() count_matrix[1:5, ] dim(count_matrix) ``` - **Uma tabela que descreve as amostras**, disponível [aqui](https://carpentries-incubator.github.io/bioc-intro/data/sample_metadata.csv).

source: ```{r} sample_metadata <- read.csv("data/sample_metadata.csv") sample_metadata dim(sample_metadata) ``` - **A table describing the genes**, available [here](https://carpentries-incubator.github.io/bioc-intro/data/gene_metadata.csv).
pt: ```{r} sample_metadata <- read.csv("data/sample_metadata.csv") sample_metadata dim(sample_metadata) ``` - **Uma tabela que descreve os genes**, disponível [here](https://carpentries-incubator.github.io/bioc-intro/data/gene_metadata.csv).

source: ```{r} gene_metadata <- read.csv("data/gene_metadata.csv") gene_metadata[1:10, 1:4] dim(gene_metadata) ``` We will create a `SummarizedExperiment` from these tables: - The count matrix that will be used as the **`assay`** - The table describing the samples will be used as the **sample metadata** slot - The table describing the genes will be used as the **features metadata** slot To do this we can put the different parts together using the `SummarizedExperiment` constructor: ```{r, message=FALSE, warning=FALSE} ## BiocManager::install("SummarizedExperiment") library("SummarizedExperiment") ``` First, we make sure that the samples are in the same order in the count matrix and the sample annotation, and the same for the genes in the count matrix and the gene annotation.
pt: ```{r} gene_metadata <- read.csv("data/gene_metadata.csv") gene_metadata[1:10, 1:4] dim(gene_metadata) ``` Vamos criar um `SummarizedExperiment` a partir destas tabelas: - A matriz de contagem que será utilizada como **`ensaio`** - A tabela que descreve as amostras será utilizada como compartimento para **sample metadata** - A tabela que descreve os genes será utilizada como compartimento para **features (variáveis) metadata** Para o fazer, podemos juntar as diferentes partes utilizando o construtor `SummarizedExperiment`: ```{r, message=FALSE, warning=FALSE} ## BiocManager::install("SummarizedExperiment") library("SummarizedExperiment") ``` Primeiro, certificamo-nos de que as amostras estão na mesma ordem na matriz de contagem e na anotação da amostra, e o mesmo para os genes na matriz de contagem e na anotação dos genes.

source: ```{r} stopifnot(rownames(count_matrix) == gene_metadata$gene) stopifnot(colnames(count_matrix) == sample_metadata$sample) ``` ```{r} se <- SummarizedExperiment(assays = list(counts = count_matrix), colData = sample_metadata, rowData = gene_metadata) se ``` ### Saving data Exporting data to a spreadsheet, as we did in a previous episode, has several limitations, such as those described in the first chapter (possible inconsistencies with `,` and `.` for decimal separators and lack of variable type definitions).
pt: ```{r} stopifnot(rownames(count_matrix) == gene_metadata$gene) stopifnot(colnames(count_matrix) == sample_metadata$sample) ``` ```{r} se <- SummarizedExperiment(assays = list(counts = count_matrix), colData = sample_metadata, rowData = gene_metadata) se ``` ### Guardar dados A exportação dos dados para uma spreadsheet, como fizemos num episódio anterior, tem várias limitações, como as descritas no primeiro capítulo (possíveis inconsistências com `,` e `.` para separadores decimais e falta de definições de tipos de variáveis).

source: Furthermore, exporting data to a spreadsheet is only relevant for rectangular data such as dataframes and matrices.
pt: Além disso, a exportação dos dados para uma spreadsheet só é relevante para dados retangulares, tais como data.frames e matrizes.

source: A more general way to save data, that is specific to R and is guaranteed to work on any operating system, is to use the `saveRDS` function.
pt: Uma forma mais geral de guardar dados, que é específica do R e é garantida para funcionar em qualquer sistema operativo, é utilizar a função `saveRDS`.

source: Saving objects like this will generate a binary representation on disk (using the `rds` file extension here), which can be loaded back into R using the `readRDS` function.
pt: Guardar objetos como este irá gerar uma representação binária no disco (usando a extensão de arquivo `rds` aqui), que pode ser carregada de volta para o R usando a função `readRDS`.

source: ```{r, eval=FALSE} saveRDS(se, file = "data_output/se.rds") rm(se) se <- readRDS("data_output/se.rds") head(se) ``` To conclude, when it comes to saving data from R that will be loaded again in R, saving and loading with `saveRDS` and `readRDS` is the preferred approach.
pt: ```{r, eval=FALSE} saveRDS(se, file = "data_output/se.rds") rm(se) se <- readRDS("data_output/se.rds") head(se) ``` Para concluir, quando se trata de salvar dados do R que serão carregados novamente no R, salvar e carregar com `saveRDS` e `readRDS` é a abordagem preferida.

source: If tabular data need to be shared with somebody that is not using R, then exporting to a text-based spreadsheet is a good alternative.
pt: Se os dados tabulares tiverem de ser partilhados com alguém que não utilize o R, então a exportação para spreadsheet baseada em texto é uma boa alternativa.

source: Using this data structure, we can access the expression matrix with the `assay` function: ```{r} head(assay(se)) dim(assay(se)) ``` We can access the sample metadata using the `colData` function: ```{r} colData(se) dim(colData(se)) ``` We can also access the feature metadata using the `rowData` function: ```{r} head(rowData(se)) dim(rowData(se)) ``` ### Subsetting a SummarizedExperiment SummarizedExperiment can be subset just like with data frames, with numerics or with characters of logicals.
pt: Utilizando esta estrutura de dados, podemos acessar a matriz de expressão com a função `assay`: ```{r} head(assay(se)) dim(assay(se)) ``` Podemos acessar aos metadados da amostra utilizando a função `colData`: ```{r} colData(se) dim(colData(se)) ``` Também podemos aceder aos metadados da caraterística utilizando a função `rowData`: ```{r} head(rowData(se)) dim(rowData(se)) ``` ### Subconjunto de um SummarizedExperiment SummarizedExperiment pode ser subconjunto tal como os data frames, com números ou com caracteres lógicos.

source: Below, we create a new instance of class SummarizedExperiment that contains only the 5 first features for the 3 first samples.
pt: Abaixo, criamos uma nova instância da classe SummarizedExperiment que contém apenas as 5 primeiras variáveis para as 3 primeiras amostras.

source: ```{r} se1 <- se[1:5, 1:3] se1 ``` ```{r} colData(se1) rowData(se1) ``` We can also use the `colData()` function to subset on something from the sample metadata or the `rowData()` to subset on something from the feature metadata.
pt: ```{r} se1 <- se[1:5, 1:3] se1 ``` ```{r} colData(se1) rowData(se1) ``` Também podemos utilizar a função `colData()` para fazer um subconjunto de algo dos metadados da amostra ou a função `rowData()` para fazer um subconjunto de algo dos metadados da caraterística .

source: For example, here we keep only miRNAs and the non infected samples: ```{r} se1 <- se[rowData(se)$gene_biotype == "miRNA", colData(se)$infection == "NonInfected"] se1 assay(se1) colData(se1) rowData(se1) ``` <!--For the following exercise, you should download the SE.rda object (that contains the `se` object), and open the file using the 'load()' function.--> <!-- ```{r, eval = FALSE, echo = FALSE} --> <!-- download.file(url = "https://raw.githubusercontent.com/UCLouvain-CBIO/bioinfo-training-01-intro-r/master/data/SE.rda", --> <!-- destfile = "data/SE.rda") --> <!-- load("data/SE.rda") --> <!-- ``` --> ::::::::::::::::::::::::::::::::::::::: challenge ## Challenge Extract the gene expression levels of the 3 first genes in samples at time 0 and at time 8.
pt: Por exemplo, aqui mantemos apenas os miRNAs e as amostras não infectadas : ```{r} se1 <- se[rowData(se)$gene_biotype == "miRNA", colData(se)$infection == "NonInfected"] se1 assay(se1) colData(se1) rowData(se1) ``` <!--Para o exercício a seguir, você deve fazer download do objeto SE.rda (que contém o objeto `se`) e abrir o arquivo usando a função 'load()' função.--> <!-- ```{r, eval = FALSE, echo = FALSE} --> <!-- download.file(url = "https://raw.githubusercontent.com/UCLouvain-CBIO/bioinfo-training-01-intro-r/master/data/SE.rda", --> <!-- destfile = "data/SE.rda") --> <!-- load("data/SE.rda") --> <!-- ``` --> ::::::::::::::::::::::::::::::::::::::: challenge ## Challenge Extraia os níveis de expressão genética dos 3 primeiros genes nas amostras no tempo 0 e no tempo 8.

source: ::::::::::::::: solution ## Solution ```{r, purl=FALSE} assay(se)[1:3, colData(se)$time != 4] # Equivalent to assay(se)[1:3, colData(se)$time == 0 | colData(se)$time == 8] ``` ::::::::::::::::::::::::: :::::::::::::::::::::::::::::::::::::::::::::::::: ::::::::::::::::::::::::::::::::::::::: challenge ## Challenge Verify that you get the same values using the long `rna` table.
pt: ::::::::::::::: Resposta ## Resposta ```{r, purl=FALSE} assay(se)[1:3, colData(se)$time != 4] # Equivalente a assay(se)[1:3, colData(se)$time == 0 | colData(se)$time == 8] ``` ::::::::::::::::::::::::: :::::::::::::::::::::::::::::::::::::::::::::::::: ::::::::::::::::::::::::::::::::::::::: Desafio ## Desafio Verifique se obtém os mesmos valores utilizando a tabela `rna` longa.

source: ::::::::::::::: solution ## Solution ```{r, purl=FALSE} rna |> filter(gene %in% c("Asl", "Apod", "Cyd2d22")) |> filter(time != 4) |> select(expression) ``` ::::::::::::::::::::::::: :::::::::::::::::::::::::::::::::::::::::::::::::: The long table and the `SummarizedExperiment` contain the same information, but are simply structured differently.
pt: ::::::::::::::: Resposta ## Resposta ```{r, purl=FALSE} rna |> filter(gene %in% c("Asl", "Apod", "Cyd2d22")) |> filter(time != 4) |> select(expression) ``` ::::::::::::::::::::::::: :::::::::::::::::::::::::::::::::::::::::::::::::: A tabela longa e o `SummarizedExperiment` contêm as mesmas informações , mas são simplesmente estruturados de forma diferente.

source: Each approach has its own advantages: the former is a good fit for the `tidyverse` packages, while the latter is the preferred structure for many bioinformatics and statistical processing steps.
pt: Cada abordagem tem as suas próprias vantagens: a primeira adequa-se bem aos pacotes `tidyverse`, enquanto a segunda é a estrutura preferida para muitas etapas de processamento bioinformático e estatístico.

source: For example, a typical RNA-Seq analyses using the `DESeq2` package.
pt: Por exemplo, uma análise típica de RNA-Seq utilizando o pacote `DESeq2`.

source: #### Adding variables to metadata We can also add information to the metadata.
pt: #### Adicionar variáveis aos metadados Também podemos adicionar informações aos metadados.

source: Suppose that you want to add the center where the samples were collected...
pt: Suponhamos que se pretende acrescentar o local onde as amostras foram recolhidas...

source: ```{r} colData(se)$center <- rep("University of Illinois", nrow(colData(se))) colData(se) ``` This illustrates that the metadata slots can grow indefinitely without affecting the other structures!
pt: ```{r} colData(se)$center <- rep("University of Illinois", nrow(colData(se))) colData(se) ``` Isto ilustra que as ranhuras de metadados podem crescer indefinidamente sem afetar as outras estruturas!

source: ### tidySummarizedExperiment You may be wondering, can we use tidyverse commands to interact with `SummarizedExperiment` objects?
pt: ### tidySummarizedExperiment Você deve estar se perguntando, podemos usar comandos tidyverse para interagir com objectos `SummarizedExperiment`?

source: The answer is yes, we can with the `tidySummarizedExperiment` package.
pt: A resposta é sim, podemos fazê-lo com o pacote `tidySummarizedExperiment`.

source: Remember what our SummarizedExperiment object looks like: ```{r, message=FALSE} se ``` Load `tidySummarizedExperiment` and then take a look at the se object again.
pt: Lembre-se do aspeto do nosso objeto SummarizedExperiment: ```{r, message=FALSE} se ``` Carregue `tidySummarizedExperiment` e depois dê uma olhada no objeto `se` novamente.

source: ```{r, message=FALSE} #BiocManager::install("tidySummarizedExperiment") library("tidySummarizedExperiment") se ``` It's still a `SummarizedExperiment` object, so maintains the efficient structure, but now we can view it as a tibble.
pt: ```{r, message=FALSE} #BiocManager::install("tidySummarizedExperiment") library("tidySummarizedExperiment") se ``` Continua a ser um objeto `SummarizedExperiment`, por isso mantém a estrutura eficiente, mas agora podemos vê-lo como um tibble.

source: Note the first line of the output says this, it's a `SummarizedExperiment`\-`tibble` abstraction.
pt: Repare que na primeira linha do output diz isto: `SummarizedExperiment`\-`tibble` abstraction.

source: We can also see in the second line of the output the number of transcripts and samples.
pt: Também podemos ver na segunda linha do output o número de transcrições e amostras.

source: If we want to revert to the standard `SummarizedExperiment` view, we can do that.
pt: Se quisermos, podemos reverter para a visualização padrão do `SummarizedExperiment`.

source: ```{r} options("restore_SummarizedExperiment_show" = TRUE) se ``` But here we use the tibble view.
pt: ```{r} options("restore_SummarizedExperiment_show" = TRUE) se ``` Mas aqui utilizamos a visualização do tibble.
