Repository: bioconductor-translations/bioc-intro-translation-Portuguese
Catalog: 60-next-steps_*.xliff
Languages: pt

source: ```{r} options("restore_SummarizedExperiment_show" = FALSE) se ``` We can now use tidyverse commands to interact with the `SummarizedExperiment` object.
pt: ```{r} options("restore_SummarizedExperiment_show" = FALSE) se ``` Agora podemos usar comandos do tidyverse para interagir com o objeto `SummarizedExperiment`.

source: We can use `filter` to filter for rows using a condition e.g. to view all rows for one sample.
pt: Podemos utilizar `filter` para filtrar as linhas utilizando uma condição, por exemplo, para visualizar todas as linhas de uma amostra.

source: ```{r} se %>% filter(.sample == "GSM2545336") ``` We can use `select` to specify columns we want to view.
pt: ```{r} se %>% filter(.sample == "GSM2545336") ``` Podemos utilizar `select` para especificar as colunas que pretendemos visualizar.

source: ```{r} se %>% select(.sample) ``` We can use `mutate` to add metadata info.
pt: ```{r} se %>% select(.sample) ``` Podemos utilizar `mutate` para adicionar informações dos metadados.

source: ```{r} se %>% mutate(center = "Heidelberg University") ``` We can also combine commands with the tidyverse pipe `%>%`.
pt: ```{r} se %>%% mutate(center = "Heidelberg University") ``` Também podemos combinar comandos com o pipe do tidyverse `%>%`.

source: For example, we could combine `group_by` and `summarise` to get the total counts for each sample.
pt: Por exemplo, poderíamos combinar `group_by` e `summarise` para obter o total de contagens para cada amostra.

source: ```{r} se %>% group_by(.sample) %>% summarise(total_counts=sum(counts)) ``` We can treat the tidy SummarizedExperiment object as a normal tibble for plotting.
pt: ```{r} se %>% group_by(.sample) %>% summarise(total_counts=sum(counts)) ``` Podemos tratar o objeto SummarizedExperiment como um `tibble` comum para plotagem.

source: Here we plot the distribution of counts per sample.
pt: Aqui traçamos a distribuição das contagens por amostra.

source: ```{r tidySE-plot} se %>% ggplot(aes(counts + 1, group=.sample, color=infection)) + geom_density() + scale_x_log10() + theme_bw() ``` For more information on tidySummarizedExperiment, see the package website [here](https://stemangiola.github.io/tidySummarizedExperiment/).
pt: ```{r tidySE-plot} se %>% ggplot(aes(counts + 1, group=.sample, color=infection)) + geom_density() + scale_x_log10() + theme_bw() ``` Para mais informações sobre o tidySummarizedExperiment, consulte o website do pacote [here](https://stemangiola.github.io/tidySummarizedExperiment/).

source: **Take-home message** - `SummarizedExperiment` represents an efficient way to store and handle omics data.
pt: **Mensagem para levar para casa** - O `SummarizedExperiment` representa uma forma eficiente de armazenar e tratar dados ômicos.

source: - They are used in many Bioconductor packages.
pt: - São utilizados em muitos pacotes do Bioconductor.

source: If you follow the next training focused on RNA sequencing analysis, you will learn to use the Bioconductor `DESeq2` package to do some differential expression analyses.
pt: Se seguir a próxima formação centrada na análise de sequências de RNA, aprenderá a utilizar o pacote Bioconductor `DESeq2` para efetuar algumas análises de expressão diferencial.

source: The whole analysis of the `DESeq2` package is handled in a `SummarizedExperiment`.
pt: Toda a análise do pacote `DESeq2` é tratada num `SummarizedExperiment`.

source: :::::::::::::::::::::::::::::::::::::::: keypoints - Bioconductor is a project provide support and packages for the comprehension of high high-throughput biology data.
pt: :::::::::::::::::::::::::::::::::::::::: keypoints - O Bioconductor é um projeto que fornece apoio e pacotes para a compreensão de dados biológicos de elevado rendimento.

source: - A `SummarizedExperiment` is a type of object useful to store and manage high-throughput omics data.
pt: - Um `SummarizedExperiment` é um tipo de objeto útil para armazenar e gerir dados ómicos de elevado rendimento.
